const text = `<p style="text-align:center;">
    <span >跑了没用户隐私协议</span>
</p>
<p>
    <span style=""><br/></span>
</p>
<p>
    <span style="">引言欢迎使用跑了没！我们高度重视用户个人信息与隐私安全，本隐私政策旨在清晰阐述跑了没在收集、使用、存储、共享和保护您个人信息方面的规则与方式。跑了没仅在已尽合理注意义务情况下对信息安全承担责任，因用户自身原因、不可抗力、第三方原因导致的损失平台免责。因用户违反政策、法律法规导致的损失，跑了没有权追究用户责任并采取必要措施（如限制账号、公开披露等）。因政策调整、技术升级、第三方服务变更等导致的服务中断、数据丢失，平台免责。基于此，本跑了没提供者（或简称“我们”）制定本《跑了没用户隐私政策》（下称“本政策”或“本隐私政策”），帮助您充分了解在您使用我们服务的过程中，我们会如何收集、使用、共享、存储和保护您的个人信息以及您可以如何管理您的个人信息，以便您更好地作出适当的选择。</span>
</p>
<p>
    <span style="">请您在使用跑了没服务前，请您务必先仔细阅读和理解本政策内容。特别应重点阅读我们以粗体标识的条款，确保您充分理解和同意之后再开始使用。本政策中涉及的专业词汇，我们尽量以简明通俗的表述向您解释，以便于您理解。若您对本政策内容存在任何疑问、意见或建议，可随时通过跑了没提供的联系方式与我们取得联系。</span>
</p>
<p>
    <span style="">您同意隐私政策表示您已了解我们跑了没所提供的基础功能，以及基础功能运行所需的必要个人信息，并给予相应的收集使用授权。基础功能所需的必要个人信息范围由跑了没根据实际运营和技术需求自主认定，用户不得以未明确列举为由主张未授权。涉及附加功能的开启我们会根据您的实际使用情况单独征求您的同意。如果您拒绝开启附加功能和我们收集非必要个人信息，并不会影响您使用基本功能。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 本隐私政策将帮助您了解以下内容：&nbsp;</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 一、适用范围&nbsp;</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 二、个人信息收集与使用</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 三、个人信息共享、转让与公开披露&nbsp;</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 四、个人信息存储与保护&nbsp;</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 五、您的权利&nbsp;</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 六、未成年人保护&nbsp;</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 七、隐私政策的更新&nbsp;</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; &nbsp; 八、联系我们&nbsp;</span>
</p>
<p>
    <span style="">一、适用范围</span>
</p>
<p>
    <span style="">本政策适用于用户通过跑了没网站、移动应用程序、小程序等全渠道使用跑了没服务时产生的个人信息处理活动。需要特别说明的是，除本政策说明的相关信息收集使用活动外，本政策不适用跑了没内链接跳转至第三方服务、第三方通过跑了没接口开展的服务等，其信息处理行为由第三方各自的隐私政策进行规范。</span>
</p>
<p>
    <span style="">二、个人信息收集与使用</span>
</p>
<p>
    <span style="">为实现向您提供我们服务的基本功能，您须授权我们收集、使用的必要的信息。用户应确保所提供的所有信息真实、准确、完整、有效。如用户提供虚假、过期或不准确的信息，或未及时更新相关信息，跑了没有权采取包括但不限于限制部分或全部功能、暂停或终止服务、删除相关数据等措施，且不承担因此产生的任何责任。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （一）注册与登录信息</span>
</p>
<p>
    <span style="">在注册登录环节，为完成账号创建与身份核验，我们会收集您主动提供的手机号码或电子邮箱地址，并通过发送验证码的方式验证信息真实性。同时，您设置的密码会经加密算法处理后存储，以保障账号安全。此外，您还可自愿补充个人资料，包括昵称、头像、性别、年龄、所在地区等信息，这些信息有助于我们为您提供更贴合个人需求的个性化服务，若不提供，不影响基础功能使用。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （二）运动数据信息</span>
</p>
<p>
    <span style="">自动采集：当您使用运动记录、轨迹追踪等功能时，跑了没将通过设备内置的传感器（如 GPS 定位模块、加速度计等），自动收集您的运动数据，包括运动类型、运动时长、运动距离、运动速度、运动轨迹、运动消耗卡路里等。这些数据将用于生成运动报告，直观展示您的运动成果，同时为您提供运动趋势分析、健康数据统计等服务，助力您科学规划运动计划。手动录入：您可根据实际需求，手动录入运动相关信息，如运动强度、运动感受、运动装备使用情况等。跑了没将结合手动录入数据与自动采集数据，为您提供更全面、精准的运动分析与建议，并可用于产品优化、算法训练、商业分析等多种用途。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （三）设备与使用信息</span>
</p>
<p>
    <span style="">为优化跑了没性能与用户体验，我们会收集您使用跑了没时的设备信息，包括设备型号、操作系统版本、屏幕分辨率、设备识别码（如 Android ID、IDFA 等，需经用户单独授权同意后收集）、网络连接状态等。同时，我们还将记录您在跑了没内的操作行为，如访问页面、使用功能、搜索关键词、点击链接、浏览时长等，用于分析用户行为习惯，对跑了没功能与服务进行持续改进。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （四）其他信息</span>
</p>
<p>
    <span style="">在您参与跑了没举办的线上活动、赛事报名、商品购买、社区互动等场景时，我们会根据具体服务需求，收集与活动或服务相关的必要信息，如活动报名所需的个人联系方式、收货地址，运动所需的分析数据，社区互动产生的发布内容、评论信息等。对于用户在社区发帖、评论、公开活动等场景下主动公开的信息，视为用户自愿公开，跑了没不承担隐私保护责任。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （五）信息使用目的</span>
</p>
<p>
    <span style="">提供核心服务：利用收集的个人信息，为您提供运动记录、数据统计、社交互动、商品交易等跑了没核心服务。实现个性化推荐：基于您的个人资料、运动偏好、使用习惯等信息，为您推送个性化的运动服务、装备推荐、活动邀请、资讯内容等，提升服务精准度与用户体验。优化服务质量：通过对用户信息与行为数据的分析，发现跑了没存在的问题与不足，针对性地优化跑了没功能、界面设计与服务流程。保障账户安全：运用收集的信息，识别和防范各类安全风险，如账号异常登录、数据泄露、欺诈行为等，保障您的账户与个人信息安全。开展市场调研：为提升服务质量、产品开发、市场调研等目的，您同意跑了没在符合法律法规的前提下，合理使用您的信息进行市场调研与用户需求分析，以便开发更符合用户期望的新产品与服务。如涉及超出基础服务范围的用途，将另行征求您的同意。</span>
</p>
<p>
    <span style="">三、个人信息共享、转让与公开披露</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （一）共享</span>
</p>
<p>
    <span style="">第三方服务提供商及其他业务关联方（包括但不限于广告推广合作商、市场分析机构）：为保障跑了没服务正常运行，我们可能会将必要的个人信息共享给第三方服务提供商，如支付机构、物流配送企业、云服务供应商、数据分析公司等。在共享前，我们会与第三方签订严格的保密协议，明确其对个人信息的保护责任与义务，要求其仅在履行服务职责范围内使用个人信息，并采取必要的安全措施防止信息泄露、篡改与丢失。因合作第三方违反协议或因其自身原因造成信息泄露、滥用、篡改、丢失等情形的，由该第三方独立承担全部责任。跑了没已尽到合理审慎选择及管理义务的，不承担相关连带或补充法律责任。业务合作伙伴：在开展联合营销活动、品牌合作推广等业务场景下，经您事先同意，我们会与业务合作伙伴共享部分个人信息，以实现合作目的。同时，我们将监督合作伙伴对个人信息的使用行为，确保其遵守相关法律法规与隐私保护要求。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （二）转让</span>
</p>
<p>
    <span style="">除非获得您的明确同意，或根据法律法规规定、司法机关裁判、政府部门要求，以及在涉及公司合并、分立、收购、破产清算等交易场景下，我们不会将您的个人信息转让给其他任何组织或个人。涉及公司股权变更、品牌授权等情形无需视为信息转让行为。在发生转让行为时，我们将要求受让方继续履行本隐私政策约定的保护义务。因公司合并、分立、收购、破产清算等交易场景，跑了没仅需履行法律规定的程序，无需单独通知用户。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （三）公开披露</span>
</p>
<p>
    <span style="">我们仅在以下情形下，才会公开披露您的个人信息，包括但不限于为保护跑了没、用户或公众利益、维护平台安全、应对突发事件等情形：1.获得您明确的书面同意或授权；2.根据法律法规、司法机关裁判、政府部门强制性要求，必须进行信息披露；3.如果我们确定您存在明显违反法律法规、妨碍平台正常运营或严重违反本跑了没相关协议及规则的情况，或为保护本跑了没用户或公众的人身财产安全免遭侵害，我们可能披露关于您的个人信息，包括相关违规行为（基于我方单方判定）以及本跑了没已对您采取的措施。在公开披露前，我们将评估披露行为的必要性与合法性，并可根据实际情况采取必要处理措施，是否去标识化及具体方式由跑了没自主决定，以降低对您个人权益的影响。</span>
</p>
<p>
    <span style="">四、个人信息存储与保护</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （一）存储位置</span>
</p>
<p>
    <span style="">我们收集的个人信息将存储在中国境内的服务器上。如因业务发展需要，确需将信息传输至境外，我们将按照国家相关法律法规与标准要求，采取数据加密传输、安全认证等有效措施，在法律允许及合理可行范围内，确保境外接收方具备相应的数据保护能力，保障个人信息在跨境传输过程中的安全性。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （二）存储期限</span>
</p>
<p>
    <span style="">我们将在实现本政策所述目的所需的业务实际需要期限内保留您的个人信息，具体期限由跑了没根据实际业务、技术和合规要求自主确定，但不得超过法律规定的最长时限。当信息达到存储期限，或超出使用目的所需范围，或您提出删除请求且符合相关规定时，我们将对个人信息进行删除或匿名化处理，使其无法再识别到特定个人。删除或匿名化的具体方式和标准由跑了没根据实际情况自主解释和决定。法律法规对特定信息存储期限另有规定的，从其规定。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （三）安全保护措施</span>
</p>
<p>
    <span style="">技术措施：采用符合国家信息安全等级保护制度要求的合理加密技术（如 SSL/TLS 加密协议等）对传输中的个人信息进行加密处理，防止信息在网络传输过程中被窃取；对存储的个人信息采用加密存储、访问控制、数据备份、容灾恢复等技术手段，保障信息存储安全；运用防火墙、入侵检测系统、漏洞扫描工具等，防范网络攻击与非法入侵行为。管理措施：建立完善的信息安全管理制度，明确各岗位人员的信息安全职责；对接触个人信息的员工进行严格的背景审查、保密培训与权限管理，签订保密协议，要求其遵守信息安全操作规范；定期开展信息安全风险评估与应急演练，及时发现并处理潜在的安全隐患。应急响应：制定信息安全事件应急预案，一旦发生信息泄露、丢失、篡改等安全事件，我们将立即启动应急预案，采取必要的补救措施，防止损害扩大，并按照法律法规要求，及时向您与相关监管部门报告事件情况。尽管我们采取了上述严格的安全保护措施，但由于网络环境的复杂性与技术的局限性，仍无法完全杜绝信息安全风险。在已尽合理注意义务的情况下，因不可抗力、黑客攻击、用户自身原因（如密码泄露、设备丢失、授权第三方登录等）、第三方原因或其他非跑了没可控因素导致的信息泄露、丢失、篡改等，跑了没不承担相关法律责任。因此，我们建议您妥善保管个人账号与密码，避免使用过于简单的密码，定期更换密码，并谨慎对待来自外部的信息请求与链接，防止个人信息泄露。</span>
</p>
<p>
    <span style="">五、您的权利</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （一）访问权</span>
</p>
<p>
    <span style="">您有权在符合法律法规及跑了没技术可行性前提下，随时登录跑了没账号，访问、查看您的个人信息，包括基本资料、运动数据、打卡记录等。跑了没有权对您的访问请求进行审核并在必要时予以拒绝。您可通过跑了没设置中的个人信息管理功能，对相关信息进行查阅与浏览。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （二）更正权</span>
</p>
<p>
    <span style="">若您发现跑了没存储的个人信息存在错误、不完整或不准确的情况，您可通过跑了没提供的信息编辑功能，自行更正可修改的信息；对于无法自行修改的信息，您可通过在线客服、意见反馈渠道等方式向我们提交更正申请，我们将在核实情况后，在合理期限内对信息进行更正处理，并将处理结果反馈给您。跑了没有权根据法律、技术和业务需要拒绝不合理的更正请求。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （三）删除权</span>
</p>
<p>
    <span style="">在以下情形下，您有权要求我们删除您的个人信息：1.个人信息处理目的已实现、无法实现或为实现处理目的不再必要；2.您撤回对个人信息处理的同意；3.个人信息存储期限届满；4.个人信息处理违反法律法规规定或本隐私政策约定；您不再使用跑了没服务且已注销账号。您可通过跑了没账号设置中的删除功能或联系我们的客服人员提交删除申请，我们将在收到申请后的合理期限内进行处理，并告知您处理结果。但如法律法规、监管要求、争议处理、欺诈防控、账务审计或为维护跑了没及相关方合法权益等需要保留信息的，跑了没有权在必要范围内继续保存相关信息，直至保留目的消失。对于用户的删除请求，跑了没有权根据合规、技术或业务需要，拒绝或延迟部分删除请求。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （四）撤回同意权</span>
</p>
<p>
    <span style="">您有权在符合法律法规及跑了没技术可行性前提下，随时撤回对我们收集、使用、共享个人信息的同意授权。您可通过跑了没设置中的隐私权限管理功能，关闭相应的信息收集与使用授权开关；或通过联系客服人员，提交撤回同意申请。撤回同意后将可能直接导致相关服务功能不可用，且我们不因此承担任何服务中断责任，但不影响此前基于您同意进行的个人信息处理行为的合法性。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （五）注销权</span>
</p>
<p>
    <span style="">如果您不再需要使用跑了没服务，您可通过跑了没账号设置中的注销功能，按照系统提示流程提交注销申请。注销流程需完成至少30天的账户冻结观察期，观察期内如发现争议、投诉或其他异常情形，我们有权延后注销处理。在注销账号前，请您仔细阅读相关提示信息，确认注销操作不可逆且注销后账号内所有数据（包括但不限于个人资料、运动记录、订单信息等）将被删除或匿名化处理。我们将在收到注销申请后的规定时间内完成账号注销流程，并以短信、邮件或站内信等方式通知您注销结果。因不可抗力（包括但不限于自然灾害、政策调整、战争、政府行为、黑客攻击、网络故障等）导致的个人信息泄露、毁损、丢失等，跑了没在已及时采取补救措施的情况下，免除相应法律责任。 部分信息因法律、合规或业务需要可继续保留，注销后用户不得要求恢复或索取相关数据。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （六）获取个人信息副本权</span>
</p>
<p>
    <span style="">在符合法律法规规定的前提下，您有权在符合法律法规及跑了没技术可行性的前提下，要求我们向您提供您的个人信息副本。跑了没有权收取合理成本费用，并对副本内容和范围进行限制。您可通过联系跑了没客服人员，提交获取个人信息副本的书面申请，我们将在核实您的身份后，在合理期限内以电子数据形式向您提供个人信息副本，法律法规另有规定的除外。</span>
</p>
<p>
    <span style="">&nbsp; &nbsp; （七）投诉与建议权</span>
</p>
<p>
    <span style="">如果您对我们的个人信息处理行为存在疑问、不满或有改进建议，您可随时通过跑了没在线客服、意见反馈渠道、官方客服电话、邮件等方式与我们联系。我们将在收到您的反馈后的合理时间内，在法律允许及合理资源范围内进行处理与回复，平台不承诺具体处理结果或补偿。</span>
</p>
<p>
    <span style="">六、未成年人保护</span>
</p>
<p>
    <span style="">我们非常重视对未成年人个人信息的保护。跑了没服务主要面向成年人，若您是未满 18 周岁的未成年人，建议您在父母或其他监护人的陪同与指导下阅读本隐私政策，并在取得监护人同意后使用跑了没服务。用户申报的年龄信息视为真实有效，平台不主动核查用户年龄，仅在合理可得信息范围内发现未经监护人同意收集了未成年人的个人信息时，平台将在发现后24小时内启动删除程序并留存处置记录，并合理限制未成年人继续使用相关服务。因用户虚假申报导致的风险由用户自行承担，平台免责。</span>
</p>
<p>
    <span style="">七、隐私政策更新</span>
</p>
<p>
    <span style="">我们将根据法律法规变化、业务发展需求、技术更新迭代等情况，适时对本隐私政策进行修订与更新。用户有义务定期查阅最新政策版本，怠于查阅导致的损失由用户自行承担。更新后的隐私政策将在跑了没显著位置进行公示，并通过弹窗提示、站内信通知、公告等方式告知您。重大变更将至少提前30日通过平台公告、弹窗提示等方式通知用户。跑了没有权根据法律法规、业务发展或技术变更单方修订本隐私政策。若您在隐私政策更新后继续使用跑了没服务，即视为您已充分阅读、理解并同意接受更新后的政策内容。对于重大变更，跑了没仅需通过显著位置公示、弹窗、站内信、公告等方式通知用户，无需逐一取得书面同意。如您对更新后的政策有异议，应在政策更新后15日内以书面形式向跑了没提出，逾期未提出的，视为您已接受更新后的政策。如您不同意更新后的政策，您应立即停止使用跑了没服务，并可按照本政策规定申请注销账号。跑了没有权在用户不同意时单方终止服务并注销账号，用户不得以旧政策主张权利。</span>
</p>
<p>
    <span style="">八、联系我们</span>
</p>
<p>
    <span style="">如果您对本隐私政策或跑了没的个人信息保护工作有任何疑问、意见或建议，欢迎通过以下方式与我们联系：在线客服：您可通过跑了没内的在线客服功能，与我们的客服人员进行实时沟通；跑了没有权根据实际运营需要随时调整联系方式、客服热线、邮箱等信息，用户不得以联系方式变更主张违约或索赔。客服电话：拨打我们的官方客服热线：XXX，工作时间为9:00-18:00；电子邮箱：发送邮件至cs@fullspeed.com，我们将在收到邮件后的 [X] 个工作日内进行回复。上述隐私政策涵盖了跑了没隐私保护的关键内容。跑了没对本隐私政策拥有最终解释权和修订权，用户不得因政策歧义主张不利于平台的解释。跑了没有权根据业务发展需要，调整、暂停或终止部分或全部服务，用户数据可根据实际情况处理，用户不得因此主张违约或索赔。若你觉得有需补充或调整的地方，比如特定功能的隐私处理，欢迎随时告知。</span>
</p>
<p>
    <br/>
</p>`

export default text; 